In [1]:
import pandas as pd
import sqlite3

In [2]:
# Load Median Houseprice and Median Income data from Excel to DataFrame
house_price_file_path = "Resources\data\house_price_data.xlsx"
house_price_df = pd.read_excel(house_price_file_path)
#house_price_df.head()

,Id,State,Median Home Price,Median Home Size (in square feet),Median Household Income
0,1,Alabama,165200,1996,52035
1,2,Alaska,293400,1857,77790
2,3,Arizona,349300,1942,61529
3,4,Arkansas,145300,1865,49475
4,5,California,684800,1778,78672

In [3]:
# Load Median Houseprice and Median Income data from DataFrame to sqlite database
db_path = "Resources\project3.sqlite"
conn = sqlite3.connect(db_path)
house_price_df.to_sql('house_data', conn, index=False, if_exists='replace')
conn.close()

In [4]:
# Load Cities and Income details from CSV to DataFrame
income_file_path = "Resources\data\income.csv"
income_df = pd.read_csv(income_file_path)
# income_df.head()
cities_file_path = "Resources\data\cities.csv"
cities_df = pd.read_csv(cities_file_path)
#cities_df.head()

           RegionName StateName       2023
0  Vineyard Haven, MA        MA  2366667.0
1         Edwards, CO        CO  1978833.0
2          Hailey, ID        ID  1545000.0
3         Jackson, WY        WY  1496333.0
4     Santa Maria, CA        CA  1451750.0

In [5]:
# Load Cities and Income details from DataFrame to sqlite database
conn = sqlite3.connect(db_path)
income_df.to_sql('income_data', conn, index=False, if_exists='replace')
income_df.to_sql('cities_data', conn, index=False, if_exists='replace')
conn.close()